tutorials/multiphase/interMixingFoam/laminar/damBreak/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 0
    volScalarFieldValue alpha2 1
    volScalarFieldValue alpha3 0
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.1461 0.292 1);
        fieldValues
        (
            volScalarFieldValue alpha1 0
            volScalarFieldValue alpha2 0
            volScalarFieldValue alpha3 1
        );
    }
    boxToCell
    {
        box (0.1461 0.05 -1) (1 1 1);
        fieldValues
        (
            volScalarFieldValue alpha1 1
            volScalarFieldValue alpha2 0
            volScalarFieldValue alpha3 0
        );
    }
);


// ************************************************************************* //
